# Practical 4

In this face-to-face class, you will be asked to solve one exercise about data manipulation, exploration, and cleaning, using Pandas.

We will explore the famous Titanic dataset listing all passengers with various properties.

Good work!!



#  Titanic Survival 

<br/>
<hr>


### Follow the steps

<br/>

### 0. Setup

### 1. Dataset

### 2. Exploration

### 3. Clean




<br/>

<hr>

# 0. Setup

<br>

### Libraries:

- pandas (https://pandas.pydata.org/docs/getting_started/index.html#getting-started)


- numpy (https://numpy.org/doc/1.15/user/quickstart.html)

In [3]:
import pandas as pd
import numpy as np

### Installation
<br>
(Replace name_of_library by the library that you want to install.)

If the import code does not show an error such as: "`ImportError: No module named name_of_library`" the library is installed.

<br>

**For Anaconda** 

Probably your environment already has this library. 

To install it go to: Anaconda Navigator -> Environments -> select the dropdown input to "all" -> search for "name_of_library" -> check and apply on "name_of_library". 

<br>

**For Google Colab** 

Execute this line of code to install it `!pip install name_of_library`.

<br>

**For Python environment** 

Execute on the terminal: `pip install name_of_library`, note that if your environment has the python 2 and 3 versions you need to execute `pip3 install name_of_library`. You can check the installed libraries by executing on terminal `pip freeze`, again, replace `pip` by `pip3` if you have python 2 and 3.

<br>
<hr>

# 1. Dataset

We will use the Boston  Titanic Dataset, data covers passengers only, not the crew.


The dataset is the `"titanic_dataset.csv"` file. A `.csv` (comma-separated values) can be seen as a table with the first line being the header and the following rows the content, the columns are separated usually by comma, but can also be separated by semicolon.

<br>

### Data Dictionary


- `Pclass` - ticket class (1 = 1st, 2 = 2nd, 3 = 3rd)


- `Survived` - survival (0 = No, 1=Yes)


- `Name` - name	


- `Sex` - sex	


- `Age`	- age in years, can be aproximated	


- `Sibsp` - number of siblings / spouses aboard the Titanic	


- `Parch` - number of parents / children aboard the Titanic	


- `Ticket` - ticket number	


- `Fare` - passenger fare (british pound)


- `Cabin` - cabin number (A = top deck, G = bottom deck)


- `Embarked` - port of embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)



## 1.1 Read into a `dataframe`

We will use the `pandas` library to read our dataset, let's read into a `dataframe`. A `dataframe` can be seen as a table, but with useful methods to interact with our data (https://pandas.pydata.org/docs/getting_started/intro_tutorials/01_table_oriented.html#min-tut-01-tableoriented).

In [4]:
# your code here

df = pd.read_csv('titanic_dataset.csv')

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 1.2 What is the size of our Dataframe?

In [9]:
# your code here
df.size

10692

# 2. Exploration

## 2.1 Display the first and last 5 rows

In [5]:
# your code here 

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
# your code here 

df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## 2.2 How many passengers do we have?

In [29]:
# your code here
len(df.PassengerId)

891

## 2.3 What type of features do we have?

In [6]:
# your code here

## 2.4 Database description

In [34]:
# your code here 
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## 2.5 Describe the features Age and Sex

In [10]:
# your code here 
# numeric description
df.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [11]:
# your code here 
# categorical description
df["Sex"].describe()

count      891
unique       2
top       male
freq       577
Name: Sex, dtype: object

## 2.6 How many persons survived?

In [16]:
# your code here 
df.Survived.value_counts()[1]
#df.Survived.sum()

np.int64(342)

## 2.7 What is the survival percentage?

In [21]:
# your code here 
df.Survived.sum()/len(df)
#df.Survived.sum()/df.shape[0]

np.float64(0.3838383838383838)

## 2.8 Build a `Survivors_df ` dataframe with three columns: Survived, Sex and Age. Sort the new dataframe by Age

In [33]:
# your code here 
Survivors_df = df[["Survived", "Sex", "Age"]]
Survivors_df.sort_values(by="Age")

     Survived     Sex   Age
803         1    male  0.42
755         1    male  0.67
644         1  female  0.75
469         1  female  0.75
78          1    male  0.83
..        ...     ...   ...
859         0    male   NaN
863         0  female   NaN
868         0    male   NaN
878         0    male   NaN
888         0  female   NaN

[891 rows x 3 columns]

## 2.9 Children
 We want to differentiate between a child and an adult and see how survival rates are affected.

Use boolean indexing to create a new dataframe called `Children_df` containing only rows of child passengers (less than 18 years old)

In [43]:
# your code here 
Children_df = df[df["Age"] < 18]
Children_df.sort_values(by="Age")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
844,845,0,3,"Culumovic, Mr. Jeso",male,17.00,0,0,315090,8.6625,NaN,S
500,501,0,3,"Calic, Mr. Petar",male,17.00,0,0,315086,8.6625,NaN,S
433,434,0,3,"Kallio, Mr. Nikolai Erland",male,17.00,0,0,STON/O 2. 3101274,7.1250,NaN,S
781,782,1,1,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.00,1,0,17474,57.0000,B20,S
550,551,1,1,"Thayer, Mr. John Borland Jr",male,17.00,0,2,17421,110.8833,C70,C

### How many children were there in the Titanic?

In [49]:
# your code here 
#Children_df.count()
len(Children_df)

113

### How many children survived?

In [54]:
# your code here 
Children_df.Survived.value_counts()[0]

np.int64(52)

## 2.10 What is the mean, max and min "Fare"?

In [61]:
# your code here 
max = df.Fare.max()
mean = df.Fare.mean()
min = df.Fare.min()

print(df.Fare.describe())

print(f"Max Fare: {max}, Mean Fare: {mean}, Min Fare: {min}")

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64
Max Fare: 512.3292, Mean Fare: 32.204207968574636, Min Fare: 0.0


## 2.11 Fare into intervals

Add the features `Fare<=32`, `Fare]32-500[`, `Fare>=500`, where boolean results from `Fare`should appear

In [27]:
# your code here

## 2.12 Count the values of the column "Pclass"

In [17]:
# your code here

### Now, count with normalization

In [18]:
# your code here

## 2.13 Convert categorical features "male" and "female" to numeric

In [19]:
# your code here

## 2.14 How many relatives

Create a new feature called `relatives` that represents the number of relatives.

In [20]:
# your code here

## 2.15 It was alone?

Create a new feature called `alone` that represents if a passenger was alone.

In [21]:
# your code here

<br>
<hr>

# 3. Clean

Clean the dataset before save it

## 3.1 Missing values

### How many missing values exist in the dataframe

In [22]:
# your code here

### Find the percentage of missing values

In [23]:
# your code here

### Since that in column Age there is a big percentage of null values, how these null values appear?

In [24]:
# your code here


## 3.2 Drop columns with significative null values

In [25]:
# your code here

## 3.3 Checkpoint

Save the cleaned dataset.

In [26]:
# your code here